KianWeng/rt-thread/bsp/frdm-kl26z/board/pin_mux.c
    /* PORTA1 (pin 23) is configured as UART0_RX */
    PORT_SetPinMux(PORTA, 1U, kPORT_MuxAlt2);

    /* PORTA12 (pin 28) is configured as PTA12 */
    PORT_SetPinMux(BOARD_SW6_PORT, BOARD_SW6_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA12 (pin 28): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW6_PORT, BOARD_SW6_PIN, kPORT_InterruptRisingEdge);

    /* PORTA13 (pin 29) is configured as PTA13 */
    PORT_SetPinMux(BOARD_SW7_PORT, BOARD_SW7_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA13 (pin 29): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW7_PORT, BOARD_SW7_PIN, kPORT_InterruptRisingEdge);

    /* PORTA19 (pin 33) is configured as PTA19 */
    PORT_SetPinMux(BOARD_SW8_PORT, BOARD_SW8_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA19 (pin 33): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW8_PORT, BOARD_SW8_PIN, kPORT_InterruptRisingEdge);

    /* PORTA2 (pin 24) is configured as UART0_TX */
    PORT_SetPinMux(PORTA, 2U, kPORT_MuxAlt2);

    /* PORTA5 (pin 27) is configured as PTA5 */
    PORT_SetPinMux(BOARD_SW5_PORT, BOARD_SW5_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTA5 (pin 27): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW5_PORT, BOARD_SW5_PIN, kPORT_InterruptRisingEdge);

    /* PORTB0 (pin 35) is configured as PTB0 */
    PORT_SetPinMux(BOARD_LCD_D1_PORT, BOARD_LCD_D1_PIN, kPORT_MuxAsGpio);

    /* PORTB1 (pin 36) is configured as PTB1 */
    PORT_SetPinMux(BOARD_LCD_D0_PORT, BOARD_LCD_D0_PIN, kPORT_MuxAsGpio);

    /* PORTB16 (pin 39) is configured as PTB16 */
    PORT_SetPinMux(BOARD_LED3_R_PORT, BOARD_LED3_R_PIN, kPORT_MuxAsGpio);

    /* PORTB17 (pin 40) is configured as PTB17 */
    PORT_SetPinMux(BOARD_LED3_G_PORT, BOARD_LED3_G_PIN, kPORT_MuxAsGpio);

    /* PORTB18 (pin 41) is configured as PTB18 */
    PORT_SetPinMux(BOARD_LED3_B_PORT, BOARD_LED3_B_PIN, kPORT_MuxAsGpio);

    /* PORTB19 (pin 42) is configured as PTB19 */
    PORT_SetPinMux(BOARD_LED2_R_PORT, BOARD_LED2_R_PIN, kPORT_MuxAsGpio);

    /* PORTB2 (pin 37) is configured as PTB2 */
    PORT_SetPinMux(BOARD_LCD_DC_PORT, BOARD_LCD_DC_PIN, kPORT_MuxAsGpio);

    /* PORTB3 (pin 38) is configured as PTB3 */
    PORT_SetPinMux(BOARD_LCD_RST_PORT, BOARD_LCD_RST_PIN, kPORT_MuxAsGpio);

    /* PORTC0 (pin 43) is configured as PTC0 */
    PORT_SetPinMux(BOARD_LED2_G_PORT, BOARD_LED2_G_PIN, kPORT_MuxAsGpio);

    /* PORTC10 (pin 55) is configured as PTC10 */
    PORT_SetPinMux(BOARD_IO8_PORT, BOARD_IO8_PIN, kPORT_MuxAsGpio);

    /* PORTC11 (pin 56) is configured as PTC11 */
    PORT_SetPinMux(BOARD_IO9_PORT, BOARD_IO9_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 45) is configured as PTC2 */
    PORT_SetPinMux(BOARD_LED2_B_PORT, BOARD_LED2_B_PIN, kPORT_MuxAsGpio);

    /* PORTC3 (pin 46) is configured as PTC3 */
    PORT_SetPinMux(BOARD_LED1_R_PORT, BOARD_LED1_R_PIN, kPORT_MuxAsGpio);

    /* PORTC4 (pin 49) is configured as PTC4 */
    PORT_SetPinMux(BOARD_LED1_G_PORT, BOARD_LED1_G_PIN, kPORT_MuxAsGpio);

    /* PORTC5 (pin 50) is configured as PTC5 */
    PORT_SetPinMux(BOARD_LED1_B_PORT, BOARD_LED1_B_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 51) is configured as PTC6 */
    PORT_SetPinMux(BOARD_SW1_PORT, BOARD_SW1_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC6 (pin 51): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW1_PORT, BOARD_SW1_PIN, kPORT_InterruptRisingEdge);

    /* PORTC7 (pin 52) is configured as PTC7 */
    PORT_SetPinMux(BOARD_SW2_PORT, BOARD_SW2_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC7 (pin 52): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW2_PORT, BOARD_SW2_PIN, kPORT_InterruptRisingEdge);

    /* PORTC8 (pin 53) is configured as PTC8 */
    PORT_SetPinMux(BOARD_SW3_PORT, BOARD_SW3_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC8 (pin 53): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW3_PORT, BOARD_SW3_PIN, kPORT_InterruptRisingEdge);

    /* PORTC9 (pin 54) is configured as PTC9 */
    PORT_SetPinMux(BOARD_SW4_PORT, BOARD_SW4_PIN, kPORT_MuxAsGpio);

    /* Interrupt configuration on PORTC9 (pin 54): Interrupt on rising edge */
    PORT_SetPinInterruptConfig(BOARD_SW4_PORT, BOARD_SW4_PIN, kPORT_InterruptRisingEdge);

    /* PORTD0 (pin 57) is configured as PTD0 */
    PORT_SetPinMux(BOARD_IO7_PORT, BOARD_IO7_PIN, kPORT_MuxAsGpio);

    /* PORTD1 (pin 58) is configured as PTD1 */
    PORT_SetPinMux(BOARD_IO6_PORT, BOARD_IO6_PIN, kPORT_MuxAsGpio);

    /* PORTD2 (pin 59) is configured as PTD2 */
    PORT_SetPinMux(BOARD_IO5_PORT, BOARD_IO5_PIN, kPORT_MuxAsGpio);

    /* PORTD3 (pin 60) is configured as PTD3 */
    PORT_SetPinMux(BOARD_IO4_PORT, BOARD_IO4_PIN, kPORT_MuxAsGpio);

    /* PORTD4 (pin 61) is configured as PTD4 */
    PORT_SetPinMux(BOARD_IO3_PORT, BOARD_IO3_PIN, kPORT_MuxAsGpio);

    /* PORTD5 (pin 62) is configured as PTD5 */
    PORT_SetPinMux(BOARD_IO2_PORT, BOARD_IO2_PIN, kPORT_MuxAsGpio);

    /* PORTD6 (pin 63) is configured as PTD6 */
    PORT_SetPinMux(BOARD_IO1_PORT, BOARD_IO1_PIN, kPORT_MuxAsGpio);

    /* PORTD7 (pin 64) is configured as PTD7 */
    PORT_SetPinMux(BOARD_IO0_PORT, BOARD_IO0_PIN, kPORT_MuxAsGpio);

    /* PORTE0 (pin 1) is configured as UART1_TX */
    PORT_SetPinMux(PORTE, 0U, kPORT_MuxAlt3);

    /* PORTE1 (pin 2) is configured as UART1_RX */
    PORT_SetPinMux(PORTE, 1U, kPORT_MuxAlt3);

    /* PORTE20 (pin 9) is configured as PTE20 */
    PORT_SetPinMux(BOARD_AD5_PORT, BOARD_AD5_PIN, kPORT_MuxAsGpio);

    /* PORTE21 (pin 10) is configured as PTE21 */
    PORT_SetPinMux(BOARD_AD4_PORT, BOARD_AD4_PIN, kPORT_MuxAsGpio);

    /* PORTE22 (pin 11) is configured as PTE22 */
    PORT_SetPinMux(BOARD_AD3_PORT, BOARD_AD3_PIN, kPORT_MuxAsGpio);

    /* PORTE23 (pin 12) is configured as PTE23 */
    PORT_SetPinMux(BOARD_AD2_PORT, BOARD_AD2_PIN, kPORT_MuxAsGpio);

    /* PORTE24 (pin 20) is configured as PTE24 */
    PORT_SetPinMux(BOARD_IO10_PORT, BOARD_IO10_PIN, kPORT_MuxAsGpio);

    /* PORTE25 (pin 21) is configured as PTE25 */
    PORT_SetPinMux(BOARD_IO11_PORT, BOARD_IO11_PIN, kPORT_MuxAsGpio);

    /* PORTE29 (pin 17) is configured as PTE29 */
    PORT_SetPinMux(BOARD_AD1_PORT, BOARD_AD1_PIN, kPORT_MuxAsGpio);

    /* PORTE30 (pin 18) is configured as PTE30 */
    PORT_SetPinMux(BOARD_AD0_PORT, BOARD_AD0_PIN, kPORT_MuxAsGpio);

    /* PORTE31 (pin 19) is configured as PTE31 */
    PORT_SetPinMux(BOARD_IO12_PORT, BOARD_IO12_PIN, kPORT_MuxAsGpio);

    SIM->SOPT5 =
        ((SIM->SOPT5 &
          /* Mask bits to zero which are setting */
          (~(SIM_SOPT5_UART0TXSRC_MASK | SIM_SOPT5_UART0RXSRC_MASK | SIM_SOPT5_UART1TXSRC_MASK | SIM_SOPT5_UART1RXSRC_MASK)))

         /* UART0 Transmit Data Source Select: UART0_TX pin. */
         | SIM_SOPT5_UART0TXSRC(SOPT5_UART0TXSRC_UART_TX)

         /* UART0 Receive Data Source Select: UART_RX pin. */
         | SIM_SOPT5_UART0RXSRC(SOPT5_UART0RXSRC_UART_RX)

         /* UART1 Transmit Data Source Select: UART1_TX pin. */
         | SIM_SOPT5_UART1TXSRC(SOPT5_UART1TXSRC_UART_TX)

         /* UART1 Receive Data Source Select: UART1_RX pin. */
         | SIM_SOPT5_UART1RXSRC(SOPT5_UART1RXSRC_UART_RX));
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
